#+BEGIN: clocktable :scope file :maxlevel 3
#+CAPTION: Clock summary at [2018-12-18 Tue 21:13]
| Headline                 | Time   |      |      |
|--------------------------+--------+------+------|
| *Total time*             | *0:57* |      |      |
|--------------------------+--------+------+------|
| PROJECT Meet better self | 0:57   |      |      |
| \_  Backend              |        | 0:57 |      |
| \_    Database elements  |        |      | 0:13 |
| \_    Cloud functions    |        |      | 0:44 |
#+END:

* PROJECT Meet better self
  DEADLINE: <2018-12-29 Sat>
  This is the wechat miniprogram written for Meet Better Self in IPOC.
  Currently, none extra toolkit is employed.

** Backend
   The backend is build with Wx Cloud.

*** Database elements
**** DONE Subject                                                    :NO_DB:
     CLOSED: [2018-12-18 Tue 16:33] SCHEDULED: <2018-12-17 Mon>
     :LOGBOOK:
     - State "DONE"       from "DELEGATED"  [2018-12-18 Tue 16:33]
     - State "DELEGATED"  from "DONE"       [2018-12-18 Tue 13:56]
     - State "DONE"       from "NEXT"       [2018-12-18 Tue 13:50]
     CLOCK: [2018-12-18 Tue 13:37]--[2018-12-18 Tue 13:50] =>  0:13
     :END:
     A subject is the term students have to punch in every day.
     A subject has the following properties:
     - title
     - description
     - punch.options
       The options may need further explanation.
       The `options` property must be a list, containing several objects.
       Example:
       { name, hint, datatype: ['number', 'bool', 'text'] }
     - punch.resolver, which is hosted on the cloud
       resolve the punch, return `data` of the new record or `error`.

**** DONE Punch                                                                 :DB:
     CLOSED: [2018-12-18 Tue 22:10]
     :LOGBOOK:
     - State "DONE"       from "NEXT"       [2018-12-18 Tue 22:10]
     :END:
     The record of punching-ins.
     Properties:
     - _openid
     - subjectId
     - credits
     - createdAt

**** TODO CreditChanges                                                  :DB:
     The additional changes on credits.
**** TODO UserBinding
     - Student Id
     - Name
*** Cloud functions
**** DONE fetchSubjects
     CLOSED: [2018-12-18 Tue 15:10] SCHEDULED: <2018-12-17 Mon>
     :LOGBOOK:
     - State "DONE"       from "NEXT"       [2018-12-18 Tue 15:10]
     CLOCK: [2018-12-18 Tue 13:51]--[2018-12-18 Tue 14:35] =>  0:44
     :END:
     fetch all subjects
**** DONE punchIn
     Params:
     - subjectId
     - options
     Results:
     - success / failure
*** Resolver Systems
    main cluster:
    front --> punchIn --(subjectId)--> resolver --> result(fail of success) --> front
    resolver(data, context):
      - data: options -- a map
      - context:
        - now
        - db
      - result: the record data generated
      - throw error

** Frontend
*** Apis
**** DONE fetchSubjects
     CLOSED: [2018-12-18 Tue 16:31] SCHEDULED: <2018-12-17 Mon>
     :LOGBOOK:
     - State "DONE"       from "NEXT"       [2018-12-18 Tue 16:31]
     :END:
     fetch the list of subjects
     the info of each subject: title, description, total records
**** DONE fetchPunchOfSubject
     fetch punch records of specified subject
*** Elements
**** DONE Index
     CLOSED: [2018-12-18 Tue 16:34]
     :LOGBOOK:
     - State "DONE"       from              [2018-12-18 Tue 16:34]
     :END:
**** DONE Subject
**** TODO UserBinding
